import pandas as pd

file_path = "성남시병원데이터.xlsx"

excel_file = pd.ExcelFile(file_path)

columns_to_use = {
    "병원정보서비스": ["암호화요양기호", "요양기관명", "종별코드", "종별코드명", "시도코드", "시도코드명", 
                  "시군구코드", "시군구코드명", "읍면동", "우편번호", "주소", "전화번호", 
                  "병원홈페이지", "개설일자", "총의사수", "좌표(X)", "좌표(Y)"],
    "시설정보": ["암호화요양기호", "요양기관명", "종별코드", "종별코드명", "설립구분코드", "설립구분코드명", 
              "시도코드", "시도코드명", "시군구코드", "시군구코드명", "읍면동", "우편번호", "주소", 
              "전화번호", "개설일자"],
    "진료과목": ["암호화요양기호", "요양기관명", "진료과목코드", "진료과목코드명", "과목별 전문의수", "선택진료 의사수"],
    "세부정보": ["암호화요양기호", "요양기관명", "위치_공공건물(장소)명", "위치_방향", "위치_거리", 
              "주차_가능대수", "주차_비용 부담여부", "주차_기타 안내사항", "휴진안내_일요일", "휴진안내_공휴일", 
              "응급실_주간_운영여부", "응급실_주간_전화번호1", "응급실_주간_전화번호2", "응급실_야간_운영여부", 
              "응급실_야간_전화번호1", "응급실_야간_전화번호2", "점심시간_평일", "점심시간_토요일", 
              "접수시간_평일", "접수시간_토요일", "진료시작시간_일요일", "진료종료시간_일요일", 
              "진료시작시간_월요일", "진료종료시간_월요일", "진료시작시간_화요일", "진료종료시간_화요일", 
              "진료시작시간_수요일", "진료종료시간_수요일", "진료시작시간_목요일", "진료종료시간_목요일", 
              "진료시작시간_금요일", "진료종료시간_금요일", "진료시작시간_토요일", "진료종료시간_토요일"],
    "교통정보": ["암호화요양기호", "요양기관명", "교통편명", "노선번호", "하차지점", "방향", "거리", "비고"]
}

for sheet, cols in columns_to_use.items():
    df = pd.read_excel(excel_file, sheet_name=sheet, usecols=lambda x: x in cols)
    df.to_csv(f"{sheet}.csv", index=False, encoding='utf-8-sig')
    print(f"{sheet}.csv 저장 완료")
